
## :white_check_mark: Apply Succeeded (list-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/79167)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.aws_kms_alias.kms_alias: Reading...
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/87f87d3f-a6a3-4115-8214-b60ff0de36df]
data.aws_region.region: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z0473210YV8ZG0O9C5XY]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=0a11e0c9-11d2-41ae-8572-fb37ee719488:ListAPI-Prod-ECS]
aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2: Refreshing state... [id=/ecs/ListAPI-Prod/aws-otel-collector20221205232452338400000001]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_sns_topic.backend_notifications: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/ListAPI-Prod]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_caller_identity.caller: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ListAPI-Prod/ecs/app]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=listapi-prod-app]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.terraform_remote_state.incident_management: Read complete after 0s
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ListAPI-Prod-ECSCodeDeployRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=895488803]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=1735779153]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/add90c251fbc8ce24938c7ee083001d39b532743]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ListAPI-Prod-TaskRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ListAPI-Prod-TaskExecutionRole]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z0473210YV8ZG0O9C5XY__266755124b347d7fb2b103c57e10b4ad.list-api.readitlater.com._CNAME]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/ListAPI-Prod-TaskExecutionRolePolicy]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/ListAPI-Prod-TaskRolePolicy]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z2BHWTOWFVNW3M]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PCEJOXZ]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=listapi-prod-app]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PGR7P9M]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_list-api.readitlater.com_NS]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ListAPI-Prod-ECSCodeDeployRole-20210517180331622800000008]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ListAPI-Prod-TaskRole-20210517180331752000000009]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ListAPI-Prod-TaskExecutionRole-2021051718033181400000000a]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ListAPI-Prod-TaskExecutionRole-2021051718033188520000000c]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2022-04-17 04:23:30.273 +0000 UTC]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ListAPI-Prod]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=96be3bd6217fdbc5584ac538e130bb87832bcc9f]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-867638e3]
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-06f55983caa3fb22b]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_vpc.pocket-vpc_2587E211: Read complete after 1s [id=vpc-867638e3]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/LSTAPI20210517180330504500000003/f9f237aa4631b55a]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/LSTAPI20210517180330798400000006/00d747ba1046109d]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0d41f0d58ada8d798]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=PP9A2JG]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PWV94OW]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/ef18393dce985407]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=ListAPI-Prod-Alarm-HTTPTarget5xxErrorRate]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PA4X50J]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z0473210YV8ZG0O9C5XY_list-api.readitlater.com_A_1]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/87fcc9c080c57013]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=PSIL3Z6]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical:08d4ae6a-9f88-4bf3-ab51-e5215fe2f425]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical:6c7cb674-bd9b-424a-bc13-964a078887c9]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/ef18393dce985407/01d12b3e75bede46]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/ListAPI-Prod/ListAPI-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=8b8a2c44-f666-4981-8bb9-800ea7f82752]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ListAPI-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ListAPI-Prod/ListAPI-Prod]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ListAPI-Prod-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ListAPI-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ListAPI-Prod Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ListAPI-Prod Service Low CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:1031" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/listapi-prod-app:823582800b99405648e8e61de833138971a637be" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/listapi-prod-app:d646cc4ba0450d3a2132dd1450e7397555e9e4ae"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ListAPI-Prod" -> (known after apply)
      ~ revision                 = 1031 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ListAPI-Prod]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 1s [id=ListAPI-Prod]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=bc2197330636a20db3d32a43d378567daa692b0d]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"761c8020-a14b-4408-8f9f-79908f84b5dc","JobName":"list-api_infrastructure_apply_prod","PRNumber":268,"Program":"tfcmt","SHA1":"d646cc4ba0450d3a2132dd1450e7397555e9e4ae","Target":"list-api-cdk","Vars":{}} -->